MikroElektronika/core_packages/ARM/gcc_clang/system/src/nxp/mkm34z/thirdparty/mkm34z/periph/PERI_SIM.h
#define SIM_SOPT1_CFG_LPTMR2SEL_MASK             (0x30U)
#define SIM_SOPT1_CFG_LPTMR2SEL_SHIFT            (4U)
/*! LPTMR2SEL - LP Timer Channel2 Select
 *  0b00..Pad PTD6
 *  0b01..Pad PTF3
 *  0b10..Pad PTG5
 *  0b11..Reserved
 */
#define SIM_SOPT1_CFG_LPTMR2SEL(x)               (((uint32_t)(((uint32_t)(x)) << SIM_SOPT1_CFG_LPTMR2SEL_SHIFT)) & SIM_SOPT1_CFG_LPTMR2SEL_MASK)

#define SIM_SOPT1_CFG_LPTMR3SEL_MASK             (0xC0U)
#define SIM_SOPT1_CFG_LPTMR3SEL_SHIFT            (6U)
/*! LPTMR3SEL - LP Timer Channel3 Select
 *  0b00..Pad PTD5
 *  0b01..Pad PTG0
 *  0b10..Pad PTG6
 *  0b11..Reserved
 */
#define SIM_SOPT1_CFG_LPTMR3SEL(x)               (((uint32_t)(((uint32_t)(x)) << SIM_SOPT1_CFG_LPTMR3SEL_SHIFT)) & SIM_SOPT1_CFG_LPTMR3SEL_MASK)

#define SIM_SOPT1_CFG_RAMSBDIS_MASK              (0x100U)
#define SIM_SOPT1_CFG_RAMSBDIS_SHIFT             (8U)
/*! RAMSBDIS
 *  0b0..Source bias of System SRAM enabled during VLPR and VLPW modes.
 *  0b1..Source bias of System SRAM disabled during VLPR and VLPW modes.
 */
#define SIM_SOPT1_CFG_RAMSBDIS(x)                (((uint32_t)(((uint32_t)(x)) << SIM_SOPT1_CFG_RAMSBDIS_SHIFT)) & SIM_SOPT1_CFG_RAMSBDIS_MASK)

#define SIM_SOPT1_CFG_RAMBPEN_MASK               (0x200U)
#define SIM_SOPT1_CFG_RAMBPEN_SHIFT              (9U)
/*! RAMBPEN - RAM Bitline Precharge Enable
 *  0b0..Bitline precharge of system SRAM disabled during VLPR and VLPW modes.
 *  0b1..Bitline precharge of system SRAM enabled during VLPR and VLPW modes.
 */
#define SIM_SOPT1_CFG_RAMBPEN(x)                 (((uint32_t)(((uint32_t)(x)) << SIM_SOPT1_CFG_RAMBPEN_SHIFT)) & SIM_SOPT1_CFG_RAMBPEN_MASK)
/*! @} */

/*! @name CTRL_REG - System Control Register */
/*! @{ */

#define SIM_CTRL_REG_NMIDIS_MASK                 (0x1U)
#define SIM_CTRL_REG_NMIDIS_SHIFT                (0U)
/*! NMIDIS - NMI Disable
 *  0b0..NMI enabled
 *  0b1..NMI disabled
 */
#define SIM_CTRL_REG_NMIDIS(x)                   (((uint32_t)(((uint32_t)(x)) << SIM_CTRL_REG_NMIDIS_SHIFT)) & SIM_CTRL_REG_NMIDIS_MASK)

#define SIM_CTRL_REG_PLLVLPEN_MASK               (0x2U)
#define SIM_CTRL_REG_PLLVLPEN_SHIFT              (1U)
/*! PLLVLPEN - PLL VLP Enable */
#define SIM_CTRL_REG_PLLVLPEN(x)                 (((uint32_t)(((uint32_t)(x)) << SIM_CTRL_REG_PLLVLPEN_SHIFT)) & SIM_CTRL_REG_PLLVLPEN_MASK)

#define SIM_CTRL_REG_ADCTRGSEL_MASK              (0x18U)
#define SIM_CTRL_REG_ADCTRGSEL_SHIFT             (3U)
/*! ADCTRGSEL - SAR ADC Trigger Clock Select
 *  0b00..Bus ClockDuring Low Power Modes such as stop, the Bus clock is not available for conversion and should
 *        not be selected in case a conversion needs to be performed while in stop.
 *  0b01..ADC asynchronous Clock
 *  0b10..ERCLK32K
 *  0b11..OSCCLK
 */
#define SIM_CTRL_REG_ADCTRGSEL(x)                (((uint32_t)(((uint32_t)(x)) << SIM_CTRL_REG_ADCTRGSEL_SHIFT)) & SIM_CTRL_REG_ADCTRGSEL_MASK)

#define SIM_CTRL_REG_CLKOUT_MASK                 (0xE0U)
#define SIM_CTRL_REG_CLKOUT_SHIFT                (5U)
/*! CLKOUT - Clock out Select
 *  0b000..Disabled
 *  0b001..Gated Core Clk
 *  0b010..Bus Clk
 *  0b011..LPO clock from PMC
 *  0b100..IRC clock from MCG
 *  0b101..Muxed 32Khz source (please refer to SOPT1[19:18] for possible options)
 *  0b110..MHz Oscillator external reference clock
 *  0b111..PLL clock output from MCG
 */
#define SIM_CTRL_REG_CLKOUT(x)                   (((uint32_t)(((uint32_t)(x)) << SIM_CTRL_REG_CLKOUT_SHIFT)) & SIM_CTRL_REG_CLKOUT_MASK)

#define SIM_CTRL_REG_SPI0_INV0_MASK              (0x100U)
#define SIM_CTRL_REG_SPI0_INV0_SHIFT             (8U)
/*! SPI0_INV0
 *  0b0..not inverted
 *  0b1..inverts SS
 */
#define SIM_CTRL_REG_SPI0_INV0(x)                (((uint32_t)(((uint32_t)(x)) << SIM_CTRL_REG_SPI0_INV0_SHIFT)) & SIM_CTRL_REG_SPI0_INV0_MASK)

#define SIM_CTRL_REG_SPI0_INV1_MASK              (0x200U)
#define SIM_CTRL_REG_SPI0_INV1_SHIFT             (9U)
/*! SPI0_INV1
 *  0b0..not inverted
 *  0b1..inverts SCK
 */
#define SIM_CTRL_REG_SPI0_INV1(x)                (((uint32_t)(((uint32_t)(x)) << SIM_CTRL_REG_SPI0_INV1_SHIFT)) & SIM_CTRL_REG_SPI0_INV1_MASK)

#define SIM_CTRL_REG_SPI0_INV2_MASK              (0x400U)
#define SIM_CTRL_REG_SPI0_INV2_SHIFT             (10U)
/*! SPI0_INV2
 *  0b0..not inverted
 *  0b1..inverts MOSI
 */
#define SIM_CTRL_REG_SPI0_INV2(x)                (((uint32_t)(((uint32_t)(x)) << SIM_CTRL_REG_SPI0_INV2_SHIFT)) & SIM_CTRL_REG_SPI0_INV2_MASK)

#define SIM_CTRL_REG_SPI0_INV3_MASK              (0x800U)
#define SIM_CTRL_REG_SPI0_INV3_SHIFT             (11U)
/*! SPI0_INV3
 *  0b0..not inverted
 *  0b1..inverts MISO
 */
#define SIM_CTRL_REG_SPI0_INV3(x)                (((uint32_t)(((uint32_t)(x)) << SIM_CTRL_REG_SPI0_INV3_SHIFT)) & SIM_CTRL_REG_SPI0_INV3_MASK)

#define SIM_CTRL_REG_SPI1_INV0_MASK              (0x1000U)
#define SIM_CTRL_REG_SPI1_INV0_SHIFT             (12U)
/*! SPI1_INV0
 *  0b0..not inverted
 *  0b1..inverts SS
 */
#define SIM_CTRL_REG_SPI1_INV0(x)                (((uint32_t)(((uint32_t)(x)) << SIM_CTRL_REG_SPI1_INV0_SHIFT)) & SIM_CTRL_REG_SPI1_INV0_MASK)

#define SIM_CTRL_REG_SPI1_INV1_MASK              (0x2000U)
#define SIM_CTRL_REG_SPI1_INV1_SHIFT             (13U)
/*! SPI1_INV1
 *  0b0..not inverted
 *  0b1..inverts SCK
 */
#define SIM_CTRL_REG_SPI1_INV1(x)                (((uint32_t)(((uint32_t)(x)) << SIM_CTRL_REG_SPI1_INV1_SHIFT)) & SIM_CTRL_REG_SPI1_INV1_MASK)

#define SIM_CTRL_REG_SPI1_INV2_MASK              (0x4000U)
#define SIM_CTRL_REG_SPI1_INV2_SHIFT             (14U)
/*! SPI1_INV2
 *  0b0..not inverted
 *  0b1..inverts MOSI
 */
#define SIM_CTRL_REG_SPI1_INV2(x)                (((uint32_t)(((uint32_t)(x)) << SIM_CTRL_REG_SPI1_INV2_SHIFT)) & SIM_CTRL_REG_SPI1_INV2_MASK)

#define SIM_CTRL_REG_SPI1_INV3_MASK              (0x8000U)
#define SIM_CTRL_REG_SPI1_INV3_SHIFT             (15U)
/*! SPI1_INV3
 *  0b0..not inverted
 *  0b1..inverts MISO
 */
#define SIM_CTRL_REG_SPI1_INV3(x)                (((uint32_t)(((uint32_t)(x)) << SIM_CTRL_REG_SPI1_INV3_SHIFT)) & SIM_CTRL_REG_SPI1_INV3_MASK)

#define SIM_CTRL_REG_PLLFLLSEL_MASK              (0x30000U)
#define SIM_CTRL_REG_PLLFLLSEL_SHIFT             (16U)
/*! PLLFLLSEL - PLL/FLL selection
 *  0b00..MCGFLLCLK
 *  0b01..MCGPLLCLK
 *  0b10..BUSCLK
 *  0b11..OSC32KCLK (RTC Oscillator output)
 */
#define SIM_CTRL_REG_PLLFLLSEL(x)                (((uint32_t)(((uint32_t)(x)) << SIM_CTRL_REG_PLLFLLSEL_SHIFT)) & SIM_CTRL_REG_PLLFLLSEL_MASK)

#define SIM_CTRL_REG_XBARCLKOUT_MASK             (0xE00000U)
#define SIM_CTRL_REG_XBARCLKOUT_SHIFT            (21U)
/*! XBARCLKOUT - XBAR clock out selection
 *  0b000..Disabled
 *  0b001..Gated Core Clk
 *  0b010..Bus Clk
 *  0b011..LPO clock from PMC
 *  0b100..IRC clock from MCG
 *  0b101..MUXed 32 kHz source (please refer to SOPT1[19:18] for possible options)
 *  0b110..MHz Oscillator external reference clock
 *  0b111..PLL clock output from MCG
 */
#define SIM_CTRL_REG_XBARCLKOUT(x)               (((uint32_t)(((uint32_t)(x)) << SIM_CTRL_REG_XBARCLKOUT_SHIFT)) & SIM_CTRL_REG_XBARCLKOUT_MASK)

